mgo-tec/ESP32_SD_EasyWebSocket/src/ESP32_SD_EasyWebSocket.cpp
/*
  ESP32_SD_EasyWebSocket.cpp - WebSocket for ESP-WROOM-32 ( ESP32 & SD microSDHC card use)
  Beta version 1.51.1

Copyright (c) 2017 Mgo-tec
This library improvement collaborator is Mr.Visyeii.
Part of WiFiServer.h(for ESP8266) library modified.

This library is used by the Arduino IDE(Tested in ver1.8.2).

Reference Blog --> https://www.mgo-tec.com

This library is free software; you can redistribute it and/or
modify it under the terms of the GNU Lesser General Public
License as published by the Free Software Foundation; either
version 2.1 of the License, or (at your option) any later version.

This library is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
Lesser General Public License for more details.

You should have received a copy of the GNU Lesser General Public
License along with this library; if not, write to the Free Software
Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

Reference LGPL-2.1 license statement --> https://opensource.org/licenses/LGPL-2.1   

WiFi.h - Included WiFi library for esp32
Based on WiFi.h from Arduino WiFi shield library.
Copyright (c) 2011-2014 Arduino.  All right reserved.
Modified by Ivan Grokhotkov, December 2014
Licensed under the LGPL-2.1

WiFiClientSecure.h
Copyright (c) 2011 Adrian McEwen.  All right reserved.
Additions Copyright (C) 2017 Evandro Luis Copercini.
Licensed under the LGPL-2.1

@file sha1.h
@date 20.05.2015
@author Steve Reid <steve@edmweb.com>
SHA-1 in C
By Steve Reid <steve@edmweb.com>
from: http://www.virtualbox.org/svn/vbox/trunk/src/recompiler/tests/sha1.c
100% Public Domain

SD.h - Included SD card library for esp32
Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
Licensed under the Apache License, Version 2.0 (the "License");

Reference Apache License --> http://www.apache.org/licenses/LICENSE-2.0
*/

#include "ESP32_SD_EasyWebSocket.h"

extern "C" {
#include "sha1/sha1.h"
}

const char* GUID_str = "258EAFA5-E914-47DA-95CA-C5AB0DC85B11";

WiFiClient __client;
WiFiServer server(80);

HTTPClientStatus1 _currentStatus;
uint32_t _statusChange;
SD_EasyWebSocket::SD_EasyWebSocket(){}

//********AP(Router) Connection****
void SD_EasyWebSocket::AP_Connect(const char* ssid, const char* password)
{
  Serial.begin(115200);
  // Connect to WiFi network
  Serial.println();
  Serial.print(F("Connecting to "));
  Serial.println(ssid);
  
  WiFi.begin(ssid, password);
  
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
		yield();
  }
  Serial.println("");
  Serial.println(F("WiFi connected"));
  
  // Start the server
  _currentStatus = HC_NONE1;
  server.begin();
  Serial.println(F("Server started"));

  // Print the IP address
  Serial.println(WiFi.localIP());
  delay(10);
  _Upgrade_first_on = false;
}
void SD_EasyWebSocket::SoftAP_setup(const char* ssid, const char* password)
{
  Serial.begin(115200);
  // Connect to WiFi network
  Serial.println();
  Serial.print(F("Connecting to "));
  Serial.println(ssid);
  
  WiFi.mode(WIFI_AP);
   
  WiFi.softAP(ssid, password);
  
  delay(1000);
   
  IPAddress myIP = WiFi.softAPIP();
  Serial.print(F("AP IP address: "));  Serial.println(myIP);
  
  // Start the server
  _currentStatus = HC_NONE1;
  server.begin();
  Serial.println(F("Server started"));

  // Print the IP address
  Serial.println(WiFi.localIP());
  delay(10);
  _Upgrade_first_on = false;
}
//*********handleClient***************
void SD_EasyWebSocket::handleClient()
{
  if (_currentStatus == HC_NONE1) {
    WiFiClient _local_client = server.available();
    if (!_local_client) {
      return;
    }

#ifdef DEBUG_ESP_HTTP_SERVER
    DEBUG_OUTPUT.println("New client");
#endif

    __client = _local_client;
    _currentStatus = HC_WAIT_READ1;
    _statusChange = millis();
  }

  if (!__client.connected()) {
    __client = WiFiClient();
    _currentStatus = HC_NONE1;
    return;
  }

  // Wait for data from client to become available
  if (_currentStatus == HC_WAIT_READ1) {
    if (!__client.available()) {
      if (millis() - _statusChange > HTTP_MAX_DATA_WAIT) {
        __client = WiFiClient();
        _currentStatus = HC_NONE1;
      }
      yield();
      return;
    }

    if (!__client.connected()) {
      __client = WiFiClient();
      _currentStatus = HC_NONE1;
      return;
    } else {
      _currentStatus = HC_WAIT_CLOSE1;
      _statusChange = millis();
      return;
    }
  }

  if (_currentStatus == HC_WAIT_CLOSE1) {
    if (millis() - _statusChange > HTTP_MAX_CLOSE_WAIT) {
      __client = WiFiClient();
      _currentStatus = HC_NONE1;
    } else {
      yield();
      return;
    }
  }
}
//*********handleClient***************
bool SD_EasyWebSocket::Get_Http_Req_Status(){
  String req;
  String hash_req_key;
  _GetLoopTime = millis();
  
  if(!_WS_on){
    handleClient();
  }else{
    return false;
  }

  if(__client){
    _GetLoopTime = millis();
    while(!_WS_on){
      if(millis()-_GetLoopTime > 5000L){
        SD_EasyWebSocket::HandShake_timeout(1);
        break;
      }

      delay(1);
      switch(_Ini_html_on){
        case 0:
          _GetLoopTime = millis();
          while(__client){
            if(millis()-_GetLoopTime > 5000L){
              SD_EasyWebSocket::HandShake_timeout(2);
              break;
            }
            if(__client.available()){
              req = __client.readStringUntil('\n');
              if(req.indexOf("GET / HTTP") != -1){
                Serial.println(F("-------HTTP Request from Browser"));
                Serial.println(req);
                return true;
              }else if(req.indexOf("GET /favicon") != -1){
                SD_EasyWebSocket::Favicon_Response(req, 0, 1, 2);
                break;
              }
            }
						yield();
          }
          break;
        case 1:
          switch(_WS_on){
            case 0:
              SD_EasyWebSocket::EWS_HTTP_Responce();
              _PingLastTime = millis();
              _PongLastTime = millis();
              break;
            case 1:
              Serial.println(F("-------WebSocket HandShake Complete!"));
              _GetLoopTime = millis();
              break;
          }
          break;
      }
	  	yield();
    }
  }
  return false;
}
//****************************************
bool SD_EasyWebSocket::http_resp(){
  String req = "";
  while(req.indexOf("\r") != 0){
    req = __client.readStringUntil('\n');
    if(req.indexOf("Upgrade: websocket") != -1){
      Serial.println(F("-------Connection: Upgrade HTTP Request"));
      Serial.println(req);
      _Ini_html_on = 1;
      _Upgrade_first_on = true;
      SD_EasyWebSocket::EWS_HTTP_Responce();
      _PingLastTime = millis();
      _PongLastTime = millis();
      break;
    }

    if(req.indexOf("Android") != -1){
      _Android_or_iPad = 'A';
    }else if(req.indexOf("iPad") != -1){
      _Android_or_iPad = 'i';
    }else if(req.indexOf("iPhone") != -1){
      _Android_or_iPad = 'P';
    }
    Serial.println(req);
    yield();
  }
  req = "";

  if(_Upgrade_first_on == true) return true;

  Serial.println(F("-------HTTP Response Send to Browser"));
  delay(10);

  __client.print(F("HTTP/1.1 200 OK\r\n"));
  __client.print(F("Content-Type:text/html\r\n"));
  __client.print(F("Connection:close\r\n\r\n"));
  
