mgo-tec/ESP32_SD_EasyWebSocket/src/ESP32_SD_EasyWebSocket.cpp
      uint8_t m_data[data_len];
      char data_c[data_len + 1];
          
      for(i = 0; i<data_len; i++){
        m_data[i] = __client.read();
        data_c[i] = mask[i%4]^m_data[i];
      }
      data_c[data_len] = '\0';

      return String(data_c);

    }else if(b == B10001000){
      Serial.println(F("------------------Close Command Received"));
      b = __client.read();
      Serial.println(b,BIN);
      data_len = b - B10000000;
      if(data_len == 0){
        while(__client.available()){
          b = __client.read();
					yield();
        }
        Serial.println(F("Closing HandShake OK!"));
      }else{
        for(i=0; i<4; i++){
          mask[i] = __client.read();
        }

        uint8_t m_data2[data_len];
        char data_c2[data_len + 1];

        for(i = 0; i<data_len; i++){
          m_data2[i] = __client.read();
          data_c2[i] = mask[i%4]^m_data2[i];
          if(i>1){
            Serial.write(data_c2[i]);
          }
        }
        data_c2[data_len] = '\0';
        Serial.println(F("----Closing Message"));
      }    
      
      delay(1);
      __client.write(B10001000);
      delay(1);
      Serial.println(F("------------------Close Command Send"));
      
      delay(5);
      __client.stop();
      delay(5);
      __client.flush();
      Serial.println();
      Serial.println(F("------------------Client.STOP"));
      _WS_on = 0;
      _Ini_html_on = 0;
      _Upgrade_first_on = false;
      
      while(__client){
        if(__client.available()){
          String req = __client.readStringUntil('\n');
          Serial.println(req);
          if(req.indexOf("GET /favicon") != -1){
            Favicon_Response(req, 0, 0, 0);
            break;
          }
        }
				yield();
      }
      
      return str_close;
    }else{
      return String('\0');
    }
  }else{
    return String('\0');
  }
}

String SD_EasyWebSocket::EWS_ESP32DataReceive_SD_write(uint16_t pTime, uint8_t sd_cs, char bin_file[14])
{
  uint8_t b=0;
  uint8_t data_len;
  uint8_t mask[4];
  uint8_t i;
  String str_close = "_close";

  if(_WS_on){
    if(pTime > 0){
      if(millis()-_PingLastTime > pTime){
        SD_EasyWebSocket::EWS_PING_SEND();
        _PingLastTime = millis();
      }

      if((millis() - _PongLastTime) > (pTime + 500)){
        delay(5);
        __client.stop();
        delay(5);
        __client.flush();
        Serial.println();
        Serial.println(F("-----------------Ping Non-Response Client.STOP"));
        _WS_on = 0;
        _Ini_html_on = 0;
        _Upgrade_first_on = false;
        return str_close;
      }
    }
  }
  
  if(__client.available()){
    b = __client.read();
    if(b == B10000001 || b == B10000010 || b == B10001010){
      //B10000001 Text frame
      //B10000010 Binary frame
      //B10001010 Pong frame
      switch (b){
        case B10000001:
          Serial.println(F("WebSocket Text Receive*********"));
          _PingLastTime = millis();
          _PongLastTime = millis();
          break;
        case B10000010:
          Serial.println(F("WebSocket Binary Receive*********"));
          SD_EasyWebSocket::EWS_ESP32_Binary_Receive(sd_cs, bin_file);
          _PingLastTime = millis();
          _PongLastTime = millis();
          return "_Binary";
          break;
        case B10001010:
          Serial.println(F("Pong Receive**********"));
          _PongLastTime = millis();
          break;
      }
      
      b = __client.read();
      data_len = b - B10000000;

      for(i=0; i<4; i++){
        mask[i] = __client.read();
      }
      
      uint8_t m_data[data_len];
      char data_c[data_len + 1];
          
      for(i = 0; i<data_len; i++){
        m_data[i] = __client.read();
        data_c[i] = mask[i%4]^m_data[i];
      }
      data_c[data_len] = '\0';

      return String(data_c);

    }else if(b == B10001000){
      Serial.println(F("------------------Close Command Received"));
      b = __client.read();
      Serial.println(b,BIN);
      data_len = b - B10000000;
      if(data_len == 0){
        while(__client.available()){
          b = __client.read();
					yield();
        }
        Serial.println(F("Closing HandShake OK!"));
      }else{
        for(i=0; i<4; i++){
          mask[i] = __client.read();
        }

        uint8_t m_data2[data_len];
        char data_c2[data_len + 1];

        for(i = 0; i<data_len; i++){
          m_data2[i] = __client.read();
          data_c2[i] = mask[i%4]^m_data2[i];
          if(i>1){
            Serial.write(data_c2[i]);
          }
        }
        data_c2[data_len] = '\0';
        Serial.println(F("----Closing Message"));
      }    
      
      delay(1);
      __client.write(B10001000);
      delay(1);
      Serial.println(F("------------------Close Command Send"));
      
      delay(5);
      __client.stop();
      delay(5);
      __client.flush();
      Serial.println();
      Serial.println(F("------------------Client.STOP"));
      _WS_on = 0;
      _Ini_html_on = 0;
      _Upgrade_first_on = false;
      
      while(__client){
        if(__client.available()){
          String req = __client.readStringUntil('\n');
          Serial.println(req);
          if(req.indexOf("GET /favicon") != -1){
            Favicon_Response(req, 0, 0, 0);
            break;
          }
        }
				yield();
      }
      
      return str_close;
    }
  }else{
    return String('\0');
  }
  return "";
}
//********************************************************
void SD_EasyWebSocket::EWS_ESP32_Binary_Receive(uint8_t sd_cs, char bin_file[14])
{
  uint8_t b=0;
  uint8_t data_len;
  uint8_t mask[4];
  uint16_t i;
  uint32_t iii;
  String str_close = "_close";
  String bin_file_str = String(bin_file);
  
  if(__client.available()){
      if(SD.remove(bin_file)){
        Serial.print(F("Removed ")); Serial.println(bin_file);
      }else{
        Serial.print(F("Not removed ")); Serial.println(bin_file);
      }
      File B_F = SD.open(bin_file, FILE_WRITE);

      b = __client.read();
      if(b >= B10000000){
        Serial.println(F("Mask Bit Received--------"));
      }else{
        Serial.println(F("UnMask Bit Received-------"));
      }
      data_len = b - B10000000;
      Serial.print(F("data_len =" ));
      Serial.println(data_len);
      
      uint8_t data_ext_len[8];
      uint16_t data_len16 = 0;
      uint32_t data_len32 = 0;
      
      if(data_len == 126){
        __client.read(data_ext_len, 2);
        data_len16 = data_ext_len[0]<<8 | data_ext_len[1];
        Serial.print(F("data_len16 =" ));
        Serial.println(data_len16);
      }else if(data_len ==127){
        __client.read(data_ext_len, 8);
        Serial.println(F("data_ext_len[i]-----------"));
        for(i=0;i<8;i++){
          Serial.println(data_ext_len[i]);
        }
        for(i=4; i<8; i++){
          data_len32 = data_ext_len[i]<<(8*(7-i)) | data_len32;
        }
        //data_len32 = data_ext_len[0]<<56 | data_ext_len[1]<<48 | data_ext_len[2]<<40 | data_ext_len[3]<<32 | data_ext_len[4]<<24 | data_ext_len[5]<<16 | data_ext_len[6]<<8 | data_ext_len[7];
        if(data_len32 >= 0xffffffff){
          Serial.print(F("data_len32 overload!----------"));
        }else{
          Serial.print(F("data_len32 =" ));
          Serial.print(data_len32); //シリアルでは64bitはオーバーロードしてしまうので注意
          Serial.println();
        }
      }

      for(i=0; i<4; i++){
        mask[i] = __client.read();
      }
      
