mgo-tec/ESP32_SD_EasyWebSocket/src/ESP32_SD_EasyWebSocket.cpp
  delay(5);
  __client.stop();
  delay(5);
  __client.flush();
  Serial.println(F("--------------------Client Stop"));
 
  _WS_on = 0;
  _Ini_html_on = 0;
  _Upgrade_first_on = false;
  
  return ret_str;
}

String SD_EasyWebSocket::EWS_https_Web_Get(const char* host, String target_ip, char char_tag, String Final_tag, String Begin_tag, String End_tag, String Paragraph){
  String str1;
  String str2;
  String str3;
  String ret_str = "";

  delay(10);
  __client.stop();
  delay(10);
  __client.flush();
  Serial.println(F("-------WebSocket Client Stop"));

  WiFiClientSecure Sec_client;
  const int httpsPort = 443;
 
  if (Sec_client.connect(host, httpsPort)) {
    Serial.print(host); Serial.print(F("-------------"));
    Serial.println(F("connected"));
    Serial.println(F("-------WEB HTTP GET Request"));

    
    Sec_client.print(String("GET ") + target_ip + " HTTP/1.1\r\n" +
               "Host: " + host + "\r\n" +
               "User-Agent: BuildFailureDetectorESP32\r\n" +
               "Connection: close\r\n\r\n");

    Serial.println(String("GET ") + target_ip + " HTTP/1.1\r\n" +
               "Host: " + host + "\r\n" +
               "User-Agent: BuildFailureDetectorESP32\r\n" +
               "Connection: close\r\n\r\n");

  }else {
    // if you didn't get a connection to the server:
    Serial.println("connection failed");
  }
  String dummy_str;
  uint16_t from, to;
  if(Sec_client){
    Serial.println(F("-------WEB HTTP Response"));
    while(Sec_client.connected()){
      while (Sec_client.available()) {
        if(dummy_str.indexOf(Final_tag) < 0){
          dummy_str = Sec_client.readStringUntil(char_tag);
          if(dummy_str.indexOf(Begin_tag) != -1){
            from = dummy_str.indexOf(Begin_tag) + Begin_tag.length();
            to = dummy_str.indexOf(End_tag);
            ret_str += Paragraph;
            ret_str += dummy_str.substring(from,to);
            ret_str += "  ";
          }
          dummy_str = "";
        }else{
          break;
        }
				yield();
      }
	  	yield();
    }
  }
  ret_str += "\0";

  delay(10);
  Sec_client.stop();
  delay(10);
  Sec_client.flush();
  Serial.println(F("-------Client Stop"));

  _WS_on = 0;
  _Ini_html_on = 0;
  _Upgrade_first_on = false;
  
  return ret_str;
}

bool SD_EasyWebSocket::HTTP_SD_Pic_Send(const char* Serv, const char* dir)
{
  String req = "";
  uint8_t b;
  uint8_t data_len;
  uint8_t mask[4];
  uint16_t i;
  uint32_t iii;
  String cut_str = " HTTP/1.1";
  bool ret_send = false;
  
  if(!_WS_on){
    handleClient();
  }
  
  while(__client){
    if(__client.available()){
      b = __client.read();
      if(b == B10000001 || b == B10000010 || b == B10001010 || b == B10001000){
        //B10000001 Text frame
        //B10000010 Binary frame
        //B10001010 Pong frame
        switch (b){
          case B10000001:
            Serial.println(F("WebSocket Text Receive*********"));
            _PingLastTime = millis();
            _PongLastTime = millis();
            break;
          case B10000010:
            Serial.println(F("WebSocket Binary Receive*********"));
            _PingLastTime = millis();
            _PongLastTime = millis();
            break;
          case B10001010:
            _PongLastTime = millis();
            Serial.println(F("Pong Receive**********"));
            break;
          case B10001000:
            Serial.println(F("----------------HTTP_SD_Pic_Send Close Command Received"));
            _PingLastTime = millis();
            _PongLastTime = millis();
            break;
        }

        b = __client.read();
        if(b >= B10000000){
          Serial.println(F("Mask Bit Received--------"));
        }else{
          Serial.println(F("UnMask Bit Received-------"));
        }
        data_len = b - B10000000;
        Serial.print(F("data_len =" ));
        Serial.println(data_len);

        for(i=0; i<4; i++){
          mask[i] = __client.read();
        }

        uint8_t mbit;
        uint8_t maskP;

        iii = 0;
        for(iii = 0; iii<data_len; iii++){
          maskP = iii%4;
          mbit = mask[maskP]^__client.read();
          if(iii>1){
            Serial.write(mbit);
          }
					yield();
        }
        Serial.println(F("----Closing Message"));
        Serial.println();
        while(__client.available()){
          Serial.println(__client.read());
					yield();
        }

        delay(5);
        __client.stop();
        delay(5);
        __client.flush();
        Serial.println();
        Serial.println(F("------------------Client.STOP"));

        _WS_on = 0;
        _Ini_html_on = 0;
        _Upgrade_first_on = false;
      }
      
      while(__client){
        if(__client.available()){
          req = __client.readStringUntil('\n');
          if(req != "") Serial.println(req);
          if(req.indexOf(dir) > 0){
            Serial.println(req);
            String file_path = req.substring(req.indexOf(dir), req.indexOf(cut_str));
            while(__client.available()){
              Serial.write(__client.read());
							yield();
            }
            Serial.print(F("--------------")); Serial.print(file_path); Serial.println(F(" open & send\n"));

            req = "";

            __client.print(F("HTTP/1.1 200 OK\r\nContent-Type: image/jpeg\r\n"));
            __client.print(F("Connection:close\r\n\r\n"));
            File jpeg_F = SD.open(file_path, FILE_READ);
            //size_t totalSize = jpeg_F.size();
            
            char* c_fpath = 0;
            file_path.toCharArray(c_fpath, file_path.length());
            
            SD_EasyWebSocket::SD_Client_Write(jpeg_F, c_fpath);

            jpeg_F.close();

            delay(5);
            __client.stop();
            delay(5);
            __client.flush();
    
            Serial.println(F("\n--------------------GET JPEG HTTP client stop"));
            req = "";
            file_path = "";
            _WS_on = 0;
            _Ini_html_on = 0;
            _Upgrade_first_on = false;
            return true;
          }
        }
				yield();
      }
    }
		yield();
  }
  return ret_send;
}
void SD_EasyWebSocket::Favicon_Response(String str, uint8_t ws, uint8_t ini_htm, uint8_t up_f)
{
  Serial.println(F("-----------------------Favicon GET Request Received"));
  Serial.println(str);
  while(__client.available()){
    Serial.write(__client.read());
		yield();
  }
  delay(1);
  
  __client.print(F("HTTP/1.1 404 Not Found\r\n"));
  __client.print(F("Connection:close\r\n\r\n"));

  delay(5);                
  __client.stop();
  delay(5);
  __client.flush();
  
  Serial.println(F("-----------------Client.stop (by Favicon Request)"));
  
  switch(ws){
    case 1:
      _WS_on = 1;
      break;
    case 2:
      _WS_on = 0;
      break;
  }
  switch(ini_htm){
    case 1:
      _Ini_html_on = 1;
      break;
    case 2:
      _Ini_html_on = 0;
      break;
  }
  switch(up_f){
    case 1:
      _Upgrade_first_on = true;
      break;
    case 2:
      _Upgrade_first_on = false;
      break;
  }
}

void SD_EasyWebSocket::sha1( String str_data, uint8_t hash[20] ){
  SHA1_CTX ctx;
  uint8_t *data = (uint8_t *)str_data.c_str();

  SHA1Init(&ctx);
  SHA1Update(&ctx, data, str_data.length());
  SHA1Final(hash, &ctx);
}
